st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/DUAL_PORT_RTOS/Src/usbpd_dpm.c
/**
  ******************************************************************************
  * @file    usbpd_dpm.c
  * @author  MCD Application Team
  * @version V1.2.0
  * @date    17-Jan-2017
  * @brief   USBPD provider demo file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "cmsis_os.h"
#include "stm32f0xx_nucleo.h"
#include "p-nucleo-usb001.h"
#include "usbpd_dpm.h"
#include "usbpd_pwr_if.h"
#include "usbpd_cad.h" 
#include "cli_api.h"

#include "string.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#if 1
#define DPM_PORT0_PORTPOWERROLE USBPD_PORTPOWERROLE_DRP_SRC
#define DPM_PORT1_PORTPOWERROLE USBPD_PORTPOWERROLE_DRP_SNK
#else
#define DPM_PORT0_PORTPOWERROLE USBPD_PORTPOWERROLE_SRC
#define DPM_PORT1_PORTPOWERROLE USBPD_PORTPOWERROLE_SNK
#endif

/* Private macro -------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc);
void USBPD_PE_Task(void const *argument);
void USBPD_CAD_Task(void const *argument);

/* List of callbacks for PE layer */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum);
static void USBPD_DPM_SetupNewPower(uint8_t PortNum);
static USBPD_StatusTypeDef USBPD_DPM_EvaluatPRSwap(uint8_t PortNum);
static void USBPD_DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role);
static void USBPD_DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role);
static void USBPD_DPM_AssertRd(uint8_t PortNum);
static void USBPD_DPM_AssertRp(uint8_t PortNum);
static void USBPD_DPM_ExplicitContractDone(uint8_t PortNum);
static void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId , uint32_t *Ptr, uint32_t *Size);  
static void USBPD_DPM_SetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId , uint32_t *Ptr, uint32_t Size);  
static USBPD_StatusTypeDef USBPD_DPM_EvaluateRequest(uint8_t PortNum);
static USBPD_StatusTypeDef USBPD_DPM_EvaluateCapabilities(uint8_t PortNum);


/* Private variables ---------------------------------------------------------*/
USBPD_HandleTypeDef DPM_Ports[USBPD_PORT_COUNT];
#ifdef USBPD_LED_SERVER
static LED_Roles DPM_Leds[USBPD_PORT_COUNT] =
{
  {LED_PORT0_CC, LED_PORT0_VBUS, LED_PORT0_ROLE},
#if USBPD_PORT_COUNT >= 2
  {LED_PORT1_CC, LED_PORT1_VBUS, LED_PORT1_ROLE},
#endif
};
#endif
USBPD_CAD_Callbacks CAD_cbs = { USBPD_CAD_Callback };
osThreadId PETaskHandle[USBPD_PORT_COUNT];
osThreadId CADTaskHandle;
USBPD_PE_Callbacks dpmCallbacks =
{
  USBPD_DPM_SetupNewPower,
  USBPD_DPM_HardReset,
  USBPD_DPM_EvaluatPRSwap,
  USBPD_DPM_TurnOffPower,
  USBPD_DPM_TurnOnPower,
  USBPD_DPM_AssertRd,
  USBPD_DPM_AssertRp,
  USBPD_DPM_ExplicitContractDone,
  USBPD_DPM_GetDataInfo,
  USBPD_DPM_SetDataInfo,
  USBPD_DPM_EvaluateRequest,
  USBPD_DPM_EvaluateCapabilities,
};

/* Private functions ---------------------------------------------------------*/
USBPD_StatusTypeDef USBPD_DPM_RequestNewPowerProfile(uint8_t PortNum, uint8_t PDOIndex);
static int32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_SNKPowerRequest_TypeDef* PtrRequestedPower);
USBPD_StatusTypeDef DPM_SetSNKRequiredPower(uint8_t PortNum, uint32_t Current, uint32_t Voltage, uint32_t MaxVoltage, uint32_t MinVoltage);

/**
  * @brief  Initialize DPM (port power role, PWR_IF, CAD and PE Init procedures)
  * @param  None
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_Init(void)
{
  uint32_t index = 0;

  memset(&DPM_Ports, 0, sizeof(USBPD_HandleTypeDef)*USBPD_PORT_COUNT);

  DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole = DPM_PORT0_PORTPOWERROLE;
#if USBPD_PORT_COUNT==2
  DPM_Ports[USBPD_PORT_1].DPM_PortPowerRole = DPM_PORT1_PORTPOWERROLE;
#endif /*USBPD_PORT_COUNT==2*/

#ifdef USBPD_LED_SERVER
  /* Led management initialization */
  Led_Init();
#endif /* USBPD_LED_SERVER */
  
  for (index = 0; index<USBPD_PORT_COUNT; index++)
  {
    DPM_Ports[index].DPM_NumberOfRcvSRCPDO = 0;
    DPM_Ports[index].DPM_NumberOfRcvSNKPDO = 0;
    DPM_Ports[index].DPM_RcvRequestDOMsg = 0;
    DPM_Ports[index].DPM_RDOPosition = 0;
    DPM_Ports[index].DPM_RequestDOMsg = 0;
    DPM_Ports[index].DPM_RequestedVoltage = 0;
    USBPD_PWR_IF_SetRole(index, DPM_Ports[index].DPM_PortPowerRole);

#ifdef USBPD_LED_SERVER
    /* Check port role to initialize Role LED*/
    Led_Set(DPM_Leds[index].Role, LED_MODE_FromPowerRole(DPM_Ports[index].DPM_PortPowerRole), 0);
#endif /* USBPD_LED_SERVER */
  }

