st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/DUAL_PORT_RTOS/Src/usbpd_dpm.c
#ifdef USBPD_CLI
#ifndef HAL_UART_MODULE_ENABLED
#error "To enable the CLI you need the HAL_UART_MODULE_ENABLED"
#endif
  /* CLI enabling */
  CLI_Init(BSP_USART_GetHandle());
  CLI_Run();
#endif /* USBPD_CLI */  
  
  /* Initialize requested power for Sink Port */
  DPM_SetSNKRequiredPower(USBPD_PORT_0, USBPD_BOARD_MAX_CURRENT_MA, USBPD_BOARD_REQUESTED_VOLTAGE_MV, USBPD_BOARD_MAX_VOLTAGE_MV, USBPD_BOARD_MIN_VOLTAGE_MV);
#if USBPD_PORT_COUNT==2
  DPM_SetSNKRequiredPower(USBPD_PORT_1, USBPD_BOARD_MAX_CURRENT_MA, USBPD_BOARD_REQUESTED_VOLTAGE_MV, USBPD_BOARD_MAX_VOLTAGE_MV, USBPD_BOARD_MIN_VOLTAGE_MV);
#endif /*USBPD_PORT_COUNT==2*/

  /* PWR SET UP */
  USBPD_PWR_IF_Init();
  USBPD_PWR_IF_PowerResetGlobal();
  
  /* PE SET UP : Port 0 */
  USBPD_PE_Init(USBPD_PORT_0, DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole, dpmCallbacks);
#if USBPD_PORT_COUNT==2
  /* PE SET UP : Port 1 */
  USBPD_PE_Init(USBPD_PORT_1,DPM_Ports[USBPD_PORT_1].DPM_PortPowerRole, dpmCallbacks);
#endif /*USBPD_PORT_COUNT==2*/

  /* CAD SET UP */
  USBPD_CAD_Init(USBPD_PORT_0, CAD_cbs);
#if USBPD_PORT_COUNT==2
  USBPD_CAD_Init(USBPD_PORT_1, CAD_cbs);
#endif /*USBPD_PORT_COUNT==2*/
  
  /* Enable CAD on both port */
  USBPD_CAD_PortEnable(USBPD_PORT_0, USBPD_CAD_ENABLE);
#if USBPD_PORT_COUNT==2
  USBPD_CAD_PortEnable(USBPD_PORT_1, USBPD_CAD_ENABLE);
#endif /*USBPD_PORT_COUNT==2*/
  
  osThreadDef(CADTask, USBPD_CAD_Task, osPriorityLow, 0, configMINIMAL_STACK_SIZE * 4);
  CADTaskHandle = osThreadCreate(osThread(CADTask), NULL);
  
  /* PE task to be created on attachment */
  PETaskHandle[USBPD_PORT_0] = NULL;
#if USBPD_PORT_COUNT==2
  PETaskHandle[USBPD_PORT_1] = NULL;
#endif /*USBPD_PORT_COUNT==2*/
  
  return USBPD_OK;
}

/**
  * @brief  Main task for PE layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  /* Get the port number passed as parameter */
  uint8_t PortNum = USBPD_PORT_0;
#if USBPD_PORT_COUNT>=2
  if (argument)
  {
    PortNum = *(uint8_t *)argument;
  }
#endif
  
  for(;;)
  {
    /* PE DRP process */
    USBPD_PE_DRPProcess(PortNum);
    osDelay(1);
  }
}

/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_CAD_Task(void const *argument)
{
  for(;;)
  {
    USBPD_CAD_Process();
    osDelay(2);
  }
}


#ifdef USBPD_CLI
static char buffer[CLI_OUTPUT_MAX_SIZE];
#endif
/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc	The Communication Channel for the USBPD communication
  * @retval None
  */
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc)
{
  switch(State)
  {
  case USBPD_CAD_STATE_ATTACHED:
  case USBPD_CAD_STATE_ATTEMC:
    
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
    Led_Set(DPM_Leds[PortNum].Role, ((PE_GetPowerRole(PortNum) == USBPD_PORTPOWERROLE_SRC) ? LED_MODE_BLINK_ROLE_SRC : LED_MODE_BLINK_ROLE_SNK), 0);
#endif /* USBPD_LED_SERVER */

    /* In case Port role is provider only, Turn on power is executed in DPM callback */
    if (PE_GetDefaultPortPowerRole(PortNum) == USBPD_PORTPOWERROLE_SRC)
    { 
      /* An ufp is attached on the port*/
      osDelay(100);

      /* Enable VBUS */
      USBPD_DPM_TurnOnPower(PortNum, PE_GetPowerRole(PortNum));

      /* Enable VCONN*/
      USBPD_PWR_IF_Enable_VConn(PortNum, Cc);
    }
    
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    USBPD_PE_IsCableConnected(PortNum, 1);
    
    /* Create PE task */
    if(PETaskHandle[PortNum] == NULL)
    {
      osThreadDef(PETaskPORT, USBPD_PE_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 2);
      PETaskHandle[PortNum] = osThreadCreate(osThread(PETaskPORT), (void *)&PortNum);

#ifdef USBPD_CLI
      sprintf(buffer, PETaskHandle[PortNum] ? "\r\n*** Attached: Port %d CC%d\r\n>" : "\r\n*** Attached: Port %d CC%d - PE is not started!\r\n>", PortNum, Cc);
      CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */
    }
    break;
    
  case USBPD_CAD_STATE_EMC:
  case USBPD_CAD_STATE_DETACHED:
    /* In case Port role is provider only, Turn on power is executed in DPM callback */
    if (PE_GetDefaultPortPowerRole(PortNum) == USBPD_PORTPOWERROLE_SRC)
    { 
      /* Disable VBUS */
      USBPD_DPM_TurnOffPower(PortNum, PE_GetPowerRole(PortNum));

      /* Disable VCONN*/
      USBPD_PWR_IF_Enable_VConn(PortNum, CCNONE);

      osDelay(100);
    }
    
    /* The ufp is detached */
    USBPD_PE_IsCableConnected(PortNum, 0);
    /* Terminate PE task */
    if (PETaskHandle[PortNum] != NULL)
    {
      osThreadTerminate(PETaskHandle[PortNum]);
      PETaskHandle[PortNum] = NULL;

#ifdef USBPD_CLI
      if (State == USBPD_CAD_STATE_DETACHED)
      {
        sprintf(buffer, "\r\n*** Detached: Port %d\r\n>", PortNum);
        CLI_Async_Notify(buffer);
      }
#endif /* USBPD_CLI */
    }
    
    /* The ufp is detached */
    DPM_Ports[PortNum].DPM_IsConnected = 0;
    
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
    
    /* Check port role to initialize Role LED*/
    Led_Set(DPM_Leds[PortNum].Role, LED_MODE_FromPowerRole(DPM_Ports[PortNum].DPM_PortPowerRole), 0);
#endif /* USBPD_LED_SERVER */
    break;
    
  case USBPD_CAD_STATE_ACCESSORY:
#ifdef USBPD_CLI
    sprintf(buffer, "\r\n*** Attached: Port %d Audio Accessory not supported\r\n>", PortNum);
    CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */    
    break;
    
  case USBPD_CAD_STATE_DEBUG:
#ifdef USBPD_CLI
    sprintf(buffer, "\r\n*** Attached: Port %d Debug not supported\r\n>", PortNum);
    CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */    
    break;
  default:
#ifdef USBPD_CLI
    sprintf(buffer, "\r\n*** Unknown: Port %d\r\n>", PortNum);
    CLI_Async_Notify(buffer);
#endif /* USBPD_CLI */    
    break;
  }
}


/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @retval None
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum)
{
  if(USBPD_PORTPOWERROLE_SRC == PE_GetPowerRole(PortNum))
  {
    /* Reset the power supply */
    USBPD_DPM_TurnOffPower(PortNum,PE_GetPowerRole(PortNum));
    return 1;
  }
  else
  {
    return USBPD_PWR_IF_IsEnabled(PortNum);
  }
}

/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

