st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/DUAL_PORT_RTOS/Src/usbpd_dpm.c
  /* Check if get the right pdo position */
  if (rdoposition > 0)
  {
    USBPD_PWR_IF_SetProfile(PortNum, rdoposition-1);
  }
  else
  {
    /* Put it to VSafe5V */
    USBPD_PWR_IF_SetProfile(PortNum, 0);
  }
}

/**
  * @brief  Evaluate the swap request from PE.
  * @param  PortNum: The current port number
  * @retval USBPD_OK if PR_swap is possible, else USBPD_ERROR
*/
static USBPD_StatusTypeDef USBPD_DPM_EvaluatPRSwap(uint8_t PortNum)
{
  return USBPD_OK;
}

/**
  * @brief  Turn Off power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  USBPD_PWR_IF_Enable(PortNum, DISABLE, Role);
  if(USBPD_PORTPOWERROLE_SRC == Role)
  {
    osDelay(30); /* wait until discharge vbus */
  }

#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Turn On power supply.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  /* Enable the output */
  USBPD_PWR_IF_Enable(PortNum, ENABLE, Role);
  if(USBPD_PORTPOWERROLE_SRC == Role)
  {
    /* Enable the output */
    osDelay(30);
  }
  else
  {
    /* stop current sink */
  }

  /* Led feedback */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  Callback function called by PE to inform DPM that an Explicit contract is established.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_ExplicitContractDone(uint8_t PortNum)
{
  /* Turn On VBUS LED when an explicit contract is established */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_ON, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  DPM callback to allow PE to retrieve information from DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be read from DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_SRC_PDO Source PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_SNK_PDO Sink PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Received Source PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Received Sink PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Requested voltage value reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Request message DO reading requested (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data should be written (u32 pointer)
  * @param  Size Pointer on nb of u32 written by DPM
  * @retval None
  */
static void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t *Size)
{
  uint32_t index = 0;

  assert_param(Ptr);
  assert_param(Size);
  
  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case Port Source PDO Data information :
       Case Port SINK PDO Data information :
         Call PWR_IF PDO reading request.
    */
    case USBPD_CORE_DATATYPE_SRC_PDO :
    case USBPD_CORE_DATATYPE_SNK_PDO :
      USBPD_PWR_IF_GetPortPDOs(PortNum, DataId, Ptr, Size);
      break;

    /* Case Port Received Source PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Port Received Sink PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Requested voltage value Data information */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      *Ptr = DPM_Ports[PortNum].DPM_RequestedVoltage;
      *Size = 1;
      break;

    /* Case Request message DO (from Sink to Source) Data information */
    case USBPD_CORE_DATATYPE_REQUEST_DO :
      *Ptr = DPM_Ports[PortNum].DPM_RequestDOMsg;
      *Size = 1;
      break;

    /* In case of unexpected data type (reading request could not be fulfilled) :
       Set nb of read u32 to 0.
    */
    default :
      *Size = 0;
      break;
  }
}

/**
  * @brief  DPM callback to allow PE to update information in DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be updated in DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_RDO_POSITION Storage of requested DO position in PDO list
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Storage of requested voltage value
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Storage of Received Source PDO values 
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Storage of Received Sink PDO values
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_REQ_PDO Storage of Received Sink Request PDO value
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Storage of Request message DO (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data to be updated could be read (u32 pointer)
  * @param  Size nb of u32 to be updated in DPM
  * @note   In case of USBPD_CORE_DATATYPE_RDO_POSITION or USBPD_CORE_DATATYPE_REQ_VOLTAGE 
  *         data information types, Size value is expected to be equal to 1.
  * @retval None
  */
static void USBPD_DPM_SetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t Size)
{
  uint32_t index;

  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case requested DO position Data information :
    */
    case USBPD_CORE_DATATYPE_RDO_POSITION :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RDOPosition = *Ptr;
      }
      break;

    /* Case requested Voltage Data information :
    */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RequestedVoltage = *Ptr;
      }
      break;

    /* Case Received Source PDO values Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      if (Size <= USBPD_MAX_NB_PDO)
      {
        DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO = Size;
        /* Copy PDO data in DPM Handle field */
        for (index = 0; index < Size; index++)
        {
          DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] = LE32(Ptr + index);
        }
      }
      break;

