st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/DUAL_PORT_RTOS/Src/usbpd_dpm.c
  /* Get the requested voltage */
  pdhandle->DPM_RequestedVoltage = mv;
  pdhandle->DPM_SNKRDOPosition = pdoindex + 1;
  
  return USBPD_OK;
}

/**
  * @brief  Prepare sending of a new Request according to Capabilities Message from Source port
  * @param  PortNum   Index of current used port
  * @retval PDOIndex  Index of PDO within source capabilities message
  *                   PDOIndex must be from 1 to Number of received profiles
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestNewPowerProfile(uint8_t PortNum, uint8_t PDOIndex)
{
  uint32_t mv = 0, mw = 0, ma = 0, pdo;
  USBPD_SNKFixedVariableRDO_TypeDef rdpfixed;
  USBPD_SNKBatteryRDO_TypeDef rdpbattery;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  
  if((PDOIndex <= pdhandle->DPM_NumberOfRcvSRCPDO) && (PDOIndex > 0))
  {
    /* Extract power information from Power Data Object */
    USBPD_UsrLog("USBPD_DPM_RequestNewPowerProfile: Extract power information from Power Data Object\r");
    
    pdo = pdhandle->DPM_ListOfRcvSRCPDO[PDOIndex - 1];
    
    mv = ((pdo >> 10) & 0x3FF) * 50; /* mV */
    if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
    {
      mw = (pdo & 0x3FF) * 250; /* mW */
      mw = USBPD_MIN(mw, pdhandle->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits); /* mW */
      ma = mw/mv; /* mA */
    }
    else
    {
      ma = (pdo & 0x3FF) * 10; /* mA */
    }
    ma = USBPD_MIN(ma, pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits);
    mw = ma * mv; /* mW */
    
    if((pdo & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
    {
      rdpbattery.d32 = 0;
      rdpbattery.b.ObjectPosition = PDOIndex;
      rdpbattery.b.OperatingPowerIn250mWunits = mw / 250;
      rdpbattery.b.MaxOperatingPowerIn250mWunits = mw / 250; 
      pdhandle->DPM_RequestDOMsg = rdpbattery.d32;
      USBPD_UsrLog("USBPD_DPM_RequestNewPowerProfile: Battery Request Data Object %u: %d mW", pdhandle->PE_RequestDOMsg, mw);
    }
    else
    {
      rdpfixed.d32 = 0;
      rdpfixed.b.ObjectPosition = PDOIndex;
      rdpfixed.b.OperatingCurrentIn10mAunits = ma / 10;
      rdpfixed.b.MaxOperatingCurrent10mAunits = ma / 10;
      pdhandle->DPM_RequestDOMsg = rdpfixed.d32;
      USBPD_UsrLog("USBPD_DPM_RequestNewPowerProfile: Fixed Request Data Object %u: %d mV, %d mA", pdhandle->PE_RequestDOMsg, mv, ma);
    }
    
    /* Get the requested voltage */
    pdhandle->DPM_RequestedVoltage = mv;
    pdhandle->DPM_SNKRDOPosition = PDOIndex;
    ret = USBPD_PE_RequestNewPowerProfile(PortNum, PDOIndex);
  }
  else
  {
    USBPD_ErrLog("USBPD_DPM_RequestNewPowerProfile: Invalid PDO index\r");
  }
  return ret;
}


/**
  * @brief  Find PDO index that offers the most amount of power.
  * @param  PortNum Port number
  * @param  PtrRequestedPower  Sink requested power profile structure pointer
  * @retval Index of PDO within source capabilities message (-1 indicating not found)
  */
static int32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_SNKPowerRequest_TypeDef* PtrRequestedPower)
{
  uint32_t mv = 0, index  = 0, mw = 0, ma = 0, voltage = 0;
  uint32_t nbpdo;
  uint32_t *ptpdoarray;
  
  /* Max voltage is always limited by the board's max request */
  voltage = USBPD_MIN(PtrRequestedPower->OperatingVoltageInmVunits, PtrRequestedPower->MaxOperatingVoltageInmVunits);
  
  /* The requested voltage not supported by this board */
  if(USBPD_IS_VALID_VOLTAGE(voltage, PtrRequestedPower->MaxOperatingVoltageInmVunits, PtrRequestedPower->MinOperatingVoltageInmVunits) != 1)
  {
    USBPD_ErrLog("DPM_FindVoltageIndex: Requested voltage not supported by the board\r");
    return (-1);
  }

  /* Search PDO index among Source PDO of Port */
  nbpdo = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
  ptpdoarray = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO;
  
  for(index = 0; index < nbpdo; index++)
  {
    mv = ((ptpdoarray[index] >> 10) & 0x3FF) * 50;
    
    /* Skip any voltage not supported by this board */
    if(USBPD_IS_VALID_VOLTAGE(mv, PtrRequestedPower->MaxOperatingVoltageInmVunits, PtrRequestedPower->MinOperatingVoltageInmVunits) != 1)
    {
      USBPD_ErrLog("DPM_FindVoltageIndex: Skip any voltage not supported by this board\r");
    }
    else
    {
      if((ptpdoarray[index] & USBPD_PDO_TYPE_Msk) == USBPD_PDO_TYPE_BATTERY) 
      {
        mw = (ptpdoarray[index] & 0x3FF) * 250000;
      }
      else
      {
        ma = (ptpdoarray[index] & 0x3FF) * 10;
        ma = USBPD_MIN(ma, PtrRequestedPower->MaxOperatingCurrentInmAunits);
        mw = ma * mv;
      }
      mw = USBPD_MIN(mw, (PtrRequestedPower->MaxOperatingPowerInmWunits * 1000));
      
      if((voltage <= mv) && (mw <= (PtrRequestedPower->MaxOperatingPowerInmWunits * 1000)))
      {
        return index;
      }     
    }
  }
  
  return (-1);
}


/**
  * @brief  Set required power by a sink port and store it in DPM Handle
  * @param  PortNum     Index of Current used port
  * @param  Current     Sink board operating Current in mA units
  * @param  Voltage     Sink board operating Voltage in mV units
  * @param  MaxVoltage  Sink board Max supported Voltage in mV units
  * @param  MinVoltage  Sink board Min supported Voltage in mV units
  * @retval USBPD status
  */
USBPD_StatusTypeDef DPM_SetSNKRequiredPower(uint8_t PortNum, uint32_t Current, uint32_t Voltage, uint32_t MaxVoltage, uint32_t MinVoltage)
{
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  
  /* Add requested power by sink board to USB PD Handle */
  pdhandle->DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits = Current;
  pdhandle->DPM_SNKRequestedPower.OperatingVoltageInmVunits    = Voltage;
  pdhandle->DPM_SNKRequestedPower.MaxOperatingVoltageInmVunits = MaxVoltage;
  pdhandle->DPM_SNKRequestedPower.MinOperatingVoltageInmVunits = MinVoltage;
  pdhandle->DPM_SNKRequestedPower.OperatingPowerInmWunits      = (Current * Voltage) / 1000;
  pdhandle->DPM_SNKRequestedPower.MaxOperatingPowerInmWunits   = (Current * MaxVoltage) / 1000;
  
  return USBPD_OK;
}
#ifdef USBPD_CLI
/**
  * @brief  
  * @param  PortNum Index of current used port
  * @param  
  * @retval None.
  */
USBPD_StatusTypeDef DPM_CLI_GetStatusInfo(uint8_t PortNum, uint8_t *pProfile, float *pVoltage, uint32_t *pCurrentPDO)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  USBPD_PortPowerRole_TypeDef role = USBPD_PORTPOWERROLE_UNKNOWN;
  if (DPM_Ports[PortNum].DPM_IsConnected)
  {
    role = PE_GetPowerRole(PortNum);
    if (role == USBPD_PORTPOWERROLE_SNK)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_SNKRDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RequestDOMsg;
        ret = USBPD_OK;
      }
    }
    if (role == USBPD_PORTPOWERROLE_SRC)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_RDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RcvRequestDOMsg;
        ret = USBPD_OK;
      }
    }
  }
  return ret;
}
#endif /* USBPD_CLI */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
